zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFVKB-pinctrl.h
/*
 * NOTE: File generated by lpc_cfg_utils.py
 * from MIMXRT685SFVKB/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MIMXRT685SFFOB-pinctrl.h with this part's differences applied
 * below (189 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 432faede1015baa3
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT685SFVKB_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MIMXRT685SFVKB_WRAPPER_

#include "MIMXRT685SFFOB-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_CH13_PIO3_24
#undef ADC0_CH5_PIO3_23
#undef CLKIN_PIO4_1
#undef CLKOUT_PIO4_0
#undef CMP0_OUT_PIO3_3
#undef CMP0_OUT_PIO4_8
#undef CTIMER0_CAPTURE0_PIO3_12
#undef CTIMER0_CAPTURE0_PIO3_13
#undef CTIMER0_CAPTURE1_PIO3_12
#undef CTIMER0_CAPTURE1_PIO3_13
#undef CTIMER0_CAPTURE2_PIO3_12
#undef CTIMER0_CAPTURE2_PIO3_13
#undef CTIMER0_CAPTURE3_PIO3_12
#undef CTIMER0_CAPTURE3_PIO3_13
#undef CTIMER0_MATCH0_PIO3_8
#undef CTIMER0_MATCH1_PIO3_9
#undef CTIMER0_MATCH2_PIO3_10
#undef CTIMER0_MATCH3_PIO3_11
#undef CTIMER1_CAPTURE0_PIO3_12
#undef CTIMER1_CAPTURE0_PIO3_13
#undef CTIMER1_CAPTURE1_PIO3_12
#undef CTIMER1_CAPTURE1_PIO3_13
#undef CTIMER1_CAPTURE2_PIO3_12
#undef CTIMER1_CAPTURE2_PIO3_13
#undef CTIMER1_CAPTURE3_PIO3_12
#undef CTIMER1_CAPTURE3_PIO3_13
#undef CTIMER2_CAPTURE0_PIO3_12
#undef CTIMER2_CAPTURE0_PIO3_13
#undef CTIMER2_CAPTURE1_PIO3_12
#undef CTIMER2_CAPTURE1_PIO3_13
#undef CTIMER2_CAPTURE2_PIO3_12
#undef CTIMER2_CAPTURE2_PIO3_13
#undef CTIMER2_CAPTURE3_PIO3_12
#undef CTIMER2_CAPTURE3_PIO3_13
#undef CTIMER3_CAPTURE0_PIO3_12
#undef CTIMER3_CAPTURE0_PIO3_13
#undef CTIMER3_CAPTURE1_PIO3_12
#undef CTIMER3_CAPTURE1_PIO3_13
#undef CTIMER3_CAPTURE2_PIO3_12
#undef CTIMER3_CAPTURE2_PIO3_13
#undef CTIMER3_CAPTURE3_PIO3_12
#undef CTIMER3_CAPTURE3_PIO3_13
#undef CTIMER3_MATCH0_PIO3_14
#undef CTIMER3_MATCH1_PIO3_15
#undef CTIMER3_MATCH2_PIO3_16
#undef CTIMER3_MATCH3_PIO3_17
#undef CTIMER4_CAPTURE0_PIO3_12
#undef CTIMER4_CAPTURE0_PIO3_13
#undef CTIMER4_CAPTURE1_PIO3_12
#undef CTIMER4_CAPTURE1_PIO3_13
#undef CTIMER4_CAPTURE2_PIO3_12
#undef CTIMER4_CAPTURE2_PIO3_13
#undef CTIMER4_CAPTURE3_PIO3_12
#undef CTIMER4_CAPTURE3_PIO3_13
#undef CTIMER4_MATCH0_PIO3_18
#undef CTIMER4_MATCH1_PIO3_19
#undef CTIMER4_MATCH2_PIO3_20
#undef CTIMER4_MATCH3_PIO3_21
#undef DMIC0_CLK0_1_PIO3_0
#undef DMIC0_CLK2_3_PIO3_1
#undef DMIC0_CLK4_5_PIO3_2
#undef DMIC0_CLK6_7_PIO3_3
#undef DMIC0_DATA0_1_PIO3_4
#undef DMIC0_DATA2_3_PIO3_5
#undef DMIC0_DATA4_5_PIO3_6
#undef DMIC0_DATA6_7_PIO3_7
#undef FC0_CTS_SDA_SSEL0_PIO3_3
#undef FC0_RTS_SCL_SSEL1_PIO3_4
#undef FC0_RXD_SDA_MOSI_DATA_PIO3_2
#undef FC0_SCK_PIO3_0
#undef FC0_SSEL2_PIO3_5
#undef FC0_SSEL3_PIO3_6
#undef FC0_TXD_SCL_MISO_WS_PIO3_1
#undef FC1_CTS_SDA_SSEL0_PIO7_28
#undef FC1_RTS_SCL_SSEL1_PIO7_29
#undef FC1_RXD_SDA_MOSI_DATA_PIO7_27
#undef FC1_SCK_PIO7_25
#undef FC1_SSEL2_PIO7_30
#undef FC1_SSEL3_PIO7_31
#undef FC1_TXD_SCL_MISO_WS_PIO7_26
#undef FC2_CTS_SDA_SSEL0_PIO4_8
#undef FC2_RXD_SDA_MOSI_DATA_PIO7_31
#undef FC2_SCK_PIO7_24
#undef FC2_TXD_SCL_MISO_WS_PIO7_30
#undef FC5_CTS_SDA_SSEL0_PIO3_18
#undef FC5_RTS_SCL_SSEL1_PIO3_22
#undef FC5_RXD_SDA_MOSI_DATA_PIO3_17
#undef FC5_SCK_PIO3_15
#undef FC5_SSEL2_PIO3_23
#undef FC5_SSEL3_PIO3_24
#undef FC5_TXD_SCL_MISO_WS_PIO3_16
#undef FC6_CTS_SDA_SSEL0_PIO3_28
#undef FC6_RTS_SCL_SSEL1_PIO3_29
#undef FC6_RXD_SDA_MOSI_DATA_PIO3_27
#undef FC6_SCK_PIO3_25
#undef FC6_SSEL2_PIO3_30
#undef FC6_SSEL3_PIO3_31
#undef FC6_TXD_SCL_MISO_WS_PIO3_26
#undef FC7_CTS_SDA_SSEL0_PIO4_3
#undef FC7_RTS_SCL_SSEL1_PIO4_4
#undef FC7_RXD_SDA_MOSI_DATA_PIO4_2
#undef FC7_SCK_PIO4_0
#undef FC7_SSEL2_PIO4_5
#undef FC7_SSEL3_PIO4_6
#undef FC7_TXD_SCL_MISO_WS_PIO4_1
#undef FREQME_IN0_PIO4_0
#undef FREQME_IN1_PIO4_0
#undef GPIO_INT_BMAT_PIO3_21
#undef GPIO_INT_BMAT_PIO4_9
#undef GPIO_PIO30_PIO3_0
#undef GPIO_PIO310_PIO3_10
#undef GPIO_PIO311_PIO3_11
#undef GPIO_PIO312_PIO3_12
#undef GPIO_PIO313_PIO3_13
#undef GPIO_PIO314_PIO3_14
#undef GPIO_PIO315_PIO3_15
#undef GPIO_PIO316_PIO3_16
#undef GPIO_PIO317_PIO3_17
#undef GPIO_PIO318_PIO3_18
#undef GPIO_PIO319_PIO3_19
#undef GPIO_PIO31_PIO3_1
#undef GPIO_PIO320_PIO3_20
#undef GPIO_PIO321_PIO3_21
#undef GPIO_PIO322_PIO3_22
#undef GPIO_PIO323_PIO3_23
#undef GPIO_PIO324_PIO3_24
#undef GPIO_PIO325_PIO3_25
#undef GPIO_PIO326_PIO3_26
#undef GPIO_PIO327_PIO3_27
#undef GPIO_PIO328_PIO3_28
#undef GPIO_PIO329_PIO3_29
#undef GPIO_PIO32_PIO3_2
#undef GPIO_PIO330_PIO3_30
#undef GPIO_PIO331_PIO3_31
#undef GPIO_PIO33_PIO3_3
#undef GPIO_PIO34_PIO3_4
#undef GPIO_PIO35_PIO3_5
#undef GPIO_PIO36_PIO3_6
#undef GPIO_PIO37_PIO3_7
#undef GPIO_PIO38_PIO3_8
#undef GPIO_PIO39_PIO3_9
#undef GPIO_PIO40_PIO4_0
#undef GPIO_PIO41_PIO4_1
#undef GPIO_PIO42_PIO4_2
#undef GPIO_PIO43_PIO4_3
#undef GPIO_PIO44_PIO4_4
#undef GPIO_PIO45_PIO4_5
#undef GPIO_PIO46_PIO4_6
#undef GPIO_PIO47_PIO4_7
#undef GPIO_PIO48_PIO4_8
#undef GPIO_PIO49_PIO4_9
#undef GPIO_PIO724_PIO7_24
#undef GPIO_PIO725_PIO7_25
#undef GPIO_PIO726_PIO7_26
#undef GPIO_PIO727_PIO7_27
#undef GPIO_PIO728_PIO7_28
#undef GPIO_PIO729_PIO7_29
#undef GPIO_PIO730_PIO7_30
#undef GPIO_PIO731_PIO7_31
#undef MCLK_PIO3_19
#undef MCLK_PIO4_7
#undef SCT0_IN0_PIO3_19
#undef SCT0_IN0_PIO4_7
#undef SCT0_IN1_PIO3_19
#undef SCT0_IN1_PIO4_7
#undef SCT0_IN2_PIO3_19
#undef SCT0_IN2_PIO4_7
#undef SCT0_IN3_PIO3_19
#undef SCT0_IN3_PIO4_7
#undef SCT0_IN4_PIO3_19
#undef SCT0_IN4_PIO4_7
#undef SCT0_IN5_PIO3_19
#undef SCT0_IN5_PIO4_7
#undef SCT0_IN6_PIO3_19
#undef SCT0_IN6_PIO4_7
#undef SD1_CARD_DET_N_PIO3_19
#undef SD1_CLK_PIO3_8
#undef SD1_CMD_PIO3_9
#undef SD1_RESET_N_PIO3_20
#undef SD1_VOLT_PIO3_21
#undef SD1_WR_PRT_PIO3_14
#undef USDHC1_USDHC_DATA0_PIO3_10
#undef USDHC1_USDHC_DATA1_PIO3_11
#undef USDHC1_USDHC_DATA2_PIO3_12
#undef USDHC1_USDHC_DATA3_PIO3_13
#undef USDHC1_USDHC_DATA4_PIO3_15
#undef USDHC1_USDHC_DATA5_PIO3_16
#undef USDHC1_USDHC_DATA6_PIO3_17
#undef USDHC1_USDHC_DATA7_PIO3_18

#endif /* _ZEPHYR_DTS_BINDING_MIMXRT685SFVKB_WRAPPER_ */
